var left = ui.Map();
var right = ui.Map();
ui.root.clear();
ui.root.add(left);
ui.root.add(right);
ui.Map.Linker([left, right], 'change-bounds');
left.setCenter(31.672, 49.277,5);
var UA  = ee.FeatureCollection("FAO/GAUL/2015/level0") .filter(ee.Filter.eq('ADM0_NAME', 'Ukraine'));
var srtm = ee.Image('USGS/SRTMGL1_003');
left.addLayer(srtm.clip(UA),{min: 500, max: 2200, palette: ['ffffd4', 'fee391','fec44f','fe9929','d95f0e','993404']}, 'SRTM');
left.style().set('cursor', 'crosshair');
right.style().set('cursor', 'crosshair');
var inspector_srtm = ui.Panel([ui.Label('Дізнатися висоту')]);
left.add(inspector_srtm);
left.onClick(function(coords) {
  inspector_srtm.widgets().set(0, ui.Label({
    value: 'Загрузка...',
    style: {color: 'gray'}
  }));
  var point = ee.Geometry.Point(coords.lon, coords.lat);
  var select = srtm.select('elevation');
  var sample = select.sample(point, 30);
  var computedValue = sample.first().get('elevation');
computedValue.evaluate(function(result) {
    inspector_srtm.widgets().set(0, ui.Label({
      value: 'Висота: ' + result.toFixed(2),
    }));
  });
});
var ls = ee.ImageCollection('LANDSAT/LC8_L1T_8DAY_NDVI')
    .filterDate('2015-04-01', '2021-09-01')
    .filter(ee.Filter.dayOfYear(121,273));
var vis = {min: 0, max: 1, palette: ['8c510a', 'd8b365','f6e8c3','c7eae5','5ab4ac','01665e']};
right.addLayer(ls.median().clip(UA), vis, 'NDVI');
var inspector_ndvi = ui.Panel([ui.Label('Дізнатися NDVI')]);
right.add(inspector_ndvi);
right.onClick(function(coords) {
  inspector_ndvi.widgets().set(0, ui.Label({
    value: 'Загрузка...',
    style: {color: 'gray'}
  }));
  var point = ee.Geometry.Point(coords.lon, coords.lat);
  var meanNdvi = ls.reduce('mean');
  var sample = meanNdvi.sample(point, 30);
  var computedValue = sample.first().get('NDVI_mean');
  computedValue.evaluate(function(result) {
    inspector_ndvi.widgets().set(0, ui.Label({
      value: 'Середній NDVI: ' + result.toFixed(2),
    }));
  });
});
function maskS2clouds(image) {
  var qa = image.select('QA60');
  var cloudBitMask = 1 << 10;
  var cirrusBitMask = 1 << 11;
  var mask = qa.bitwiseAnd(cloudBitMask).eq(0)
      .and(qa.bitwiseAnd(cirrusBitMask).eq(0));
  return image.updateMask(mask).divide(10000);
}
var dataset = ee.ImageCollection('COPERNICUS/S2_SR')
  .filterDate('2016-05-01', '2021-01-30')
  .filter(ee.Filter.dayOfYear(121,273))
  .filter(ee.Filter.lt('CLOUDY_PIXEL_PERCENTAGE',1))
  .map(maskS2clouds)
  .select('B4', 'B3', 'B2');
var visualization = {
  min: 0.0,
  max: 0.3,
  bands: ['B4', 'B3', 'B2'],
};
right.addLayer(dataset.median().clip(UA), visualization, 'True Color (432)');
left.addLayer(dataset.median().clip(UA), visualization, 'True Color (432)');
var geometry = /* color: #ffc82d */ee.Geometry.Polygon(
        [[[24.50428540631244, 48.164569954943],
          [24.502397131165957, 48.16396884221098],
          [24.501452993592714, 48.162737970350655],
          [24.500251363954042, 48.16242309140947],
          [24.498749326905703, 48.16236584048523],
          [24.497719358643984, 48.162108210535415],
          [24.496131490907167, 48.162050959259744],
          [24.494243215760683, 48.162795220859564],
          [24.493170332154726, 48.162508967676025],
          [24.492140363893007, 48.161821953518036],
          [24.493127416810488, 48.16044789759848],
          [24.495187353333925, 48.15901655021164],
          [24.49686105175922, 48.15767104725417],
          [24.498663496217226, 48.15612510667659],
          [24.501195501527285, 48.15506582420231],
          [24.502482961854433, 48.15523760122432],
          [24.502654623231386, 48.15661179669726],
          [24.505401205262636, 48.159274195688546],
          [24.50733239575336, 48.15978948276058],
          [24.508920263490175, 48.15973222889705],
          [24.513383459290957, 48.15910243218104],
          [24.51355512066791, 48.160104377867796],
          [24.510851453980898, 48.1619364565167],
          [24.50776154919574, 48.16319597263282]]]),
    geometry2 = /* color: #00ffff */ee.Geometry.Polygon(
        [[[24.550597314658972, 48.10289076074673],
          [24.54965317708573, 48.09950892852757],
          [24.5479365633162, 48.09767462138622],
          [24.543301706138465, 48.093604518718],
          [24.541585092368933, 48.09188466019795],
          [24.542357568565222, 48.09016474415493],
          [24.54544747335038, 48.089534093859776],
          [24.54742157918534, 48.09016474415493],
          [24.552228097740027, 48.094005810762496],
          [24.555232171836707, 48.09733068151113],
          [24.557549600425574, 48.099394286248604],
          [24.560467843833777, 48.10134317022255],
          [24.563471917930457, 48.10134317022255],
          [24.566733484092566, 48.0985344610076],
          [24.572054986778113, 48.095037690210575],
          [24.577033166709754, 48.092744596648316],
          [24.580294732871863, 48.08890343583087],
          [24.58364212972245, 48.088674103721104],
          [24.596259240928504, 48.09027940701408],
          [24.597718362632605, 48.09240062379383],
          [24.596774225059363, 48.09377650140629],
          [24.589306955161902, 48.09452175307505],
          [24.58389962178788, 48.09647082175716],
          [24.57909310323319, 48.0997955331065],
          [24.57840645772538, 48.102546855767805],
          [24.575316552940222, 48.10483951216748],
          [24.57265580159745, 48.10575654609511],
          [24.566218499961707, 48.10501145727517],
          [24.561240320030066, 48.10461025112914],
          [24.5589228914412, 48.105928488135035],
          [24.562041893924807, 48.107769299710576],
          [24.562299385990237, 48.110290959893526],
          [24.56195606323633, 48.11309902675145],
          [24.560153618778322, 48.115448515801674],
          [24.559037819828127, 48.11665187102769],
          [24.557578698124026, 48.1180844000257],
          [24.5552092664239, 48.118932326060424],
          [24.549201118230542, 48.1202501957101],
          [24.545424567937573, 48.120765874631175],
          [24.54396544623347, 48.11984910852597],
          [24.545596229314526, 48.11830202862505],
          [24.547656165837964, 48.11681220394722],
          [24.548342811345776, 48.11474929845616],
          [24.550574409246167, 48.111597477357336],
          [24.552737219064447, 48.10736453937665],
          [24.550763113229486, 48.1056451411341]]]),
    geometry3 = /* color: #bf04c2 */ee.Geometry.Polygon(
        [[[24.496889779989374, 48.370659836584025],
          [24.495366285268915, 48.37038899986993],
          [24.494658182088983, 48.370175180393936],
          [24.49371404451574, 48.37006114297296],
          [24.49319906038488, 48.36997561473964],
          [24.492383668844354, 48.3699471052966],
          [24.491546819631708, 48.3697475387485],
          [24.49199743074621, 48.369462442323076],
          [24.49300594133581, 48.36940542284646],
          [24.492898652975214, 48.36912032450571],
          [24.492297838155878, 48.36850735766825],
          [24.491632650320184, 48.368179488656835],
          [24.491375158254755, 48.367309912794674],
          [24.4917613963529, 48.36683948031964],
          [24.492877195303095, 48.36646883349086],
          [24.494186113302362, 48.3659983932467],
          [24.49570960802282, 48.365656252157926],
          [24.497361848775995, 48.36524282860911],
          [24.499164293234003, 48.36414510152244],
          [24.499915311758173, 48.363731665707306],
          [24.501674840871942, 48.36337525282833],
          [24.5027477244779, 48.36307586408265],
          [24.50371331972326, 48.363246943581366],
          [24.50394935411657, 48.36354633132149],
          [24.502103994314325, 48.364515765262226],
          [24.500580499593866, 48.36581306710892],
          [24.50021571916784, 48.366796713515505],
          [24.50070924562658, 48.36756651049497],
          [24.49967663364342, 48.368605305331464],
          [24.49898998813561, 48.36967442669166],
          [24.49770252780846, 48.370543962179696]]]);
var panel = ui.Panel({style: {width:'5%'}});
ui.root.insert(0,panel);
var button_Brebeneskul = ui.Button('Бребенескул', Brebeneskul_co);
panel.add(button_Brebeneskul);
function Brebeneskul_co(){
  left.centerObject(geometry2,12);
}
var button_Hoverla = ui.Button('Говерла', Hoverla_co);
panel.add(button_Hoverla);
function Hoverla_co(){
  left.centerObject(geometry,12);
}
var button_Khomiak = ui.Button("Хом'як", Khomiak_co);
panel.add(button_Khomiak);
function Khomiak_co(){
  left.centerObject(geometry3,13);
}