var geometry = ui.import && ui.import("geometry", "geometry", {
      "geometries": [
        {
          "type": "Polygon",
          "coordinates": [
            [
              [
                37.0614928263382,
                47.44290141507541
              ],
              [
                37.0614928263382,
                46.830084497225315
              ],
              [
                38.0997008341507,
                46.830084497225315
              ],
              [
                38.0997008341507,
                47.44290141507541
              ]
            ]
          ],
          "geodesic": false,
          "evenOdd": true
        }
      ],
      "displayProperties": [],
      "properties": {},
      "color": "#d63000",
      "mode": "Geometry",
      "shown": false,
      "locked": false
    }) || 
    /* color: #d63000 */
    /* shown: false */
    ee.Geometry.Polygon(
        [[[37.0614928263382, 47.44290141507541],
          [37.0614928263382, 46.830084497225315],
          [38.0997008341507, 46.830084497225315],
          [38.0997008341507, 47.44290141507541]]], null, false),
    geometry2 = ui.import && ui.import("geometry2", "geometry", {
      "geometries": [
        {
          "type": "Polygon",
          "coordinates": [
            [
              [
                37.58397867690517,
                47.1077823107375
              ],
              [
                37.57144739638759,
                47.10217386807447
              ],
              [
                37.57076075087978,
                47.09224080120442
              ],
              [
                37.57848551284267,
                47.08242277353447
              ],
              [
                37.5886135340829,
                47.078214493407955
              ],
              [
                37.60921289931728,
                47.083474791629875
              ],
              [
                37.62294580947353,
                47.088383934725904
              ],
              [
                37.627752328028215,
                47.09364322885918
              ],
              [
                37.62431910048915,
                47.09831772098329
              ],
              [
                37.62483408462001,
                47.10217386807447
              ],
              [
                37.61848261367275,
                47.103809724888656
              ],
              [
                37.61298944961025,
                47.10708128771848
              ],
              [
                37.61590769301845,
                47.11374063363932
              ],
              [
                37.61298944961025,
                47.11712840211591
              ],
              [
                37.60749628554775,
                47.1131565138276
              ],
              [
                37.59273340712978,
                47.109651660318335
              ]
            ]
          ],
          "evenOdd": true
        }
      ],
      "displayProperties": [],
      "properties": {},
      "color": "#ffffff",
      "mode": "Geometry",
      "shown": false,
      "locked": false
    }) || 
    /* color: #ffffff */
    /* shown: false */
    ee.Geometry.Polygon(
        [[[37.58397867690517, 47.1077823107375],
          [37.57144739638759, 47.10217386807447],
          [37.57076075087978, 47.09224080120442],
          [37.57848551284267, 47.08242277353447],
          [37.5886135340829, 47.078214493407955],
          [37.60921289931728, 47.083474791629875],
          [37.62294580947353, 47.088383934725904],
          [37.627752328028215, 47.09364322885918],
          [37.62431910048915, 47.09831772098329],
          [37.62483408462001, 47.10217386807447],
          [37.61848261367275, 47.103809724888656],
          [37.61298944961025, 47.10708128771848],
          [37.61590769301845, 47.11374063363932],
          [37.61298944961025, 47.11712840211591],
          [37.60749628554775, 47.1131565138276],
          [37.59273340712978, 47.109651660318335]]]),
    geometry3 = ui.import && ui.import("geometry3", "geometry", {
      "geometries": [
        {
          "type": "LinearRing",
          "coordinates": [
            [
              37.609526443609084,
              47.117006885733275
            ],
            [
              37.60686569226631,
              47.11490415347268
            ],
            [
              37.60446243298897,
              47.11356069769424
            ],
            [
              37.601544189580764,
              47.112100381206105
            ],
            [
              37.59673767102608,
              47.11040636387876
            ],
            [
              37.592789459356155,
              47.109822207470565
            ],
            [
              37.58686714185127,
              47.10836178840012
            ],
            [
              37.57416419995674,
              47.103746600754995
            ],
            [
              37.57296257031807,
              47.10292867766134
            ],
            [
              37.57236175549873,
              47.10199389302379
            ],
            [
              37.57141761792549,
              47.100357980412966
            ],
            [
              37.57073097241768,
              47.098722017535444
            ],
            [
              37.570559311040725,
              47.09749501238965
            ],
            [
              37.57047348035225,
              47.0956252358922
            ],
            [
              37.57150344861397,
              47.09334635701667
            ],
            [
              37.57965736401924,
              47.081833606583935
            ],
            [
              37.583262252935256,
              47.08101534687607
            ],
            [
              37.58437805188545,
              47.079846382635864
            ],
            [
              37.58515052808174,
              47.07932034036025
            ],
            [
              37.58660964978584,
              47.07885274286624
            ],
            [
              37.589270401128616,
              47.07920344137145
            ],
            [
              37.59433441174873,
              47.08078155607982
            ],
            [
              37.595278549321975,
              47.08171671310936
            ],
            [
              37.59510688794502,
              47.082534962045294
            ],
            [
              37.59218864453682,
              47.08703510655398
            ],
            [
              37.593561935552444,
              47.08639225204191
            ],
            [
              37.60283164990791,
              47.08627536856983
            ],
            [
              37.603775787481155,
              47.08674290091936
            ],
            [
              37.60540657056221,
              47.08767795330778
            ],
            [
              37.60592155469307,
              47.08884674571093
            ],
            [
              37.606779861577834,
              47.08516496279341
            ],
            [
              37.60780982983955,
              47.08452208571177
            ],
            [
              37.609268951543655,
              47.084405198136125
            ],
            [
              37.61785202039131,
              47.08662601821668
            ],
            [
              37.62128524793037,
              47.08802859372169
            ],
            [
              37.626520919927444,
              47.09317105460226
            ],
            [
              37.62428932202705,
              47.09761187124079
            ],
            [
              37.62257270825752,
              47.100124274508026
            ],
            [
              37.62317352307686,
              47.10094224068724
            ],
            [
              37.622744369634475,
              47.10193546843898
            ],
            [
              37.6200836182917,
              47.10228601498621
            ],
            [
              37.61810951245674,
              47.102811830479254
            ],
            [
              37.61381797803291,
              47.10573293309311
            ],
            [
              37.61330299390205,
              47.10719342429232
            ],
            [
              37.613989639409866,
              47.1123924477094
            ],
            [
              37.613474655279006,
              47.115780302012396
            ],
            [
              37.609526443609084,
              47.117006885733275
            ]
          ]
        }
      ],
      "displayProperties": [],
      "properties": {},
      "color": "#00ffff",
      "mode": "FeatureCollection",
      "shown": true,
      "locked": false
    }) || /* color: #00ffff */ee.FeatureCollection(
        [ee.Feature(
            ee.Geometry.LinearRing(
                [[37.609526443609084, 47.117006885733275],
                 [37.60686569226631, 47.11490415347268],
                 [37.60446243298897, 47.11356069769424],
                 [37.601544189580764, 47.112100381206105],
                 [37.59673767102608, 47.11040636387876],
                 [37.592789459356155, 47.109822207470565],
                 [37.58686714185127, 47.10836178840012],
                 [37.57416419995674, 47.103746600754995],
                 [37.57296257031807, 47.10292867766134],
                 [37.57236175549873, 47.10199389302379],
                 [37.57141761792549, 47.100357980412966],
                 [37.57073097241768, 47.098722017535444],
                 [37.570559311040725, 47.09749501238965],
                 [37.57047348035225, 47.0956252358922],
                 [37.57150344861397, 47.09334635701667],
                 [37.57965736401924, 47.081833606583935],
                 [37.583262252935256, 47.08101534687607],
                 [37.58437805188545, 47.079846382635864],
                 [37.58515052808174, 47.07932034036025],
                 [37.58660964978584, 47.07885274286624],
                 [37.589270401128616, 47.07920344137145],
                 [37.59433441174873, 47.08078155607982],
                 [37.595278549321975, 47.08171671310936],
                 [37.59510688794502, 47.082534962045294],
                 [37.59218864453682, 47.08703510655398],
                 [37.593561935552444, 47.08639225204191],
                 [37.60283164990791, 47.08627536856983],
                 [37.603775787481155, 47.08674290091936],
                 [37.60540657056221, 47.08767795330778],
                 [37.60592155469307, 47.08884674571093],
                 [37.606779861577834, 47.08516496279341],
                 [37.60780982983955, 47.08452208571177],
                 [37.609268951543655, 47.084405198136125],
                 [37.61785202039131, 47.08662601821668],
                 [37.62128524793037, 47.08802859372169],
                 [37.626520919927444, 47.09317105460226],
                 [37.62428932202705, 47.09761187124079],
                 [37.62257270825752, 47.100124274508026],
                 [37.62317352307686, 47.10094224068724],
                 [37.622744369634475, 47.10193546843898],
                 [37.6200836182917, 47.10228601498621],
                 [37.61810951245674, 47.102811830479254],
                 [37.61381797803291, 47.10573293309311],
                 [37.61330299390205, 47.10719342429232],
                 [37.613989639409866, 47.1123924477094],
                 [37.613474655279006, 47.115780302012396],
                 [37.609526443609084, 47.117006885733275]]),
            {
              "system:index": "0"
            })]),
    geometry4 = ui.import && ui.import("geometry4", "geometry", {
      "geometries": [
        {
          "type": "LinearRing",
          "coordinates": [
            [
              37.56296329511055,
              47.14346266001875
            ],
            [
              37.56399326337227,
              47.14284967667582
            ],
            [
              37.56489448560127,
              47.14252858734208
            ],
            [
              37.5671689988459,
              47.14252858734208
            ],
            [
              37.57364921582588,
              47.143112384688244
            ],
            [
              37.57463626874336,
              47.14299562573188
            ],
            [
              37.57596664441475,
              47.14238263700383
            ],
            [
              37.57665328992256,
              47.1416820698028
            ],
            [
              37.57751159680733,
              47.13998899428754
            ],
            [
              37.57836990369209,
              47.139171628190255
            ],
            [
              37.58000068677315,
              47.13870455620735
            ],
            [
              37.584034729131545,
              47.13817909532219
            ],
            [
              37.58618049634346,
              47.13829586485655
            ],
            [
              37.58789711011299,
              47.139317587343484
            ],
            [
              37.590772438176955,
              47.13925920373027
            ],
            [
              37.59244613660225,
              47.139784653941234
            ],
            [
              37.59347610486397,
              47.14071877482776
            ],
            [
              37.59540729535469,
              47.140923111583966
            ],
            [
              37.597510147222366,
              47.140777156838254
            ],
            [
              37.5986688615168,
              47.14407563629373
            ],
            [
              37.5911586762751,
              47.14632315549847
            ],
            [
              37.584807205327834,
              47.148366272316515
            ],
            [
              37.57686289892648,
              47.15070430540231
            ],
            [
              37.574459639649135,
              47.15371033083288
            ],
            [
              37.56999644384835,
              47.15801402960033
            ],
            [
              37.56652030096505,
              47.16099046168145
            ],
            [
              37.56613406286691,
              47.16568821615428
            ],
            [
              37.56763609991525,
              47.16910185162758
            ],
            [
              37.5672498618171,
              47.17096904658483
            ],
            [
              37.56094100276413,
              47.17862729229092
            ],
            [
              37.558623574175265,
              47.18081501231769
            ],
            [
              37.55570533076706,
              47.18411100693474
            ],
            [
              37.553645394243624,
              47.18772761510802
            ],
            [
              37.55767943660202,
              47.19146062960575
            ],
            [
              37.56300093928757,
              47.1975977449169
            ],
            [
              37.559825203813936,
              47.19923066733859
            ],
            [
              37.563379317079665,
              47.204796836189836
            ],
            [
              37.56209185675252,
              47.207887263205535
            ],
            [
              37.5654392536031,
              47.21208529071266
            ],
            [
              37.55908778265584,
              47.215233593285376
            ],
            [
              37.54132083014119,
              47.19639929512647
            ],
            [
              37.54157832220662,
              47.18910868528104
            ],
            [
              37.54303744391072,
              47.177499967917896
            ],
            [
              37.54579019082481,
              47.17379933520051
            ],
            [
              37.544202323087994,
              47.17260323473249
            ],
            [
              37.545918936857525,
              47.170240127794536
            ],
            [
              37.54523229134971,
              47.168752191704954
            ],
            [
              37.54638142121262,
              47.16761161990129
            ],
            [
              37.54451460373826,
              47.1644750801442
            ],
            [
              37.54425711167283,
              47.163555965967205
            ],
            [
              37.54513687622971,
              47.16219914930888
            ],
            [
              37.54627413285203,
              47.16033754604183
            ],
            [
              37.547540135507056,
              47.1583386614588
            ],
            [
              37.55047983658738,
              47.155245348773256
            ],
            [
              37.551037736062476,
              47.15286687741535
            ],
            [
              37.551810212258765,
              47.15113038017749
            ],
            [
              37.552840180520484,
              47.14994836220835
            ],
            [
              37.552582688455054,
              47.14974406014182
            ],
            [
              37.553569741372534,
              47.14842796547013
            ],
            [
              37.55444950592942,
              47.1486906459157
            ],
            [
              37.55674547684617,
              47.145947030567704
            ],
            [
              37.55775398743577,
              47.145450829691804
            ],
            [
              37.559534974221656,
              47.145056784520186
            ],
            [
              37.56086534989304,
              47.14473570851702
            ],
            [
              37.561788029794165,
              47.14438544157455
            ],
            [
              37.56262487900681,
              47.14393301002473
            ],
            [
              37.56296329511055,
              47.14346266001875
            ]
          ]
        }
      ],
      "displayProperties": [],
      "properties": {},
      "color": "#bf04c2",
      "mode": "FeatureCollection",
      "shown": true,
      "locked": false
    }) || /* color: #bf04c2 */ee.FeatureCollection(
        [ee.Feature(
            ee.Geometry.LinearRing(
                [[37.56296329511055, 47.14346266001875],
                 [37.56399326337227, 47.14284967667582],
                 [37.56489448560127, 47.14252858734208],
                 [37.5671689988459, 47.14252858734208],
                 [37.57364921582588, 47.143112384688244],
                 [37.57463626874336, 47.14299562573188],
                 [37.57596664441475, 47.14238263700383],
                 [37.57665328992256, 47.1416820698028],
                 [37.57751159680733, 47.13998899428754],
                 [37.57836990369209, 47.139171628190255],
                 [37.58000068677315, 47.13870455620735],
                 [37.584034729131545, 47.13817909532219],
                 [37.58618049634346, 47.13829586485655],
                 [37.58789711011299, 47.139317587343484],
                 [37.590772438176955, 47.13925920373027],
                 [37.59244613660225, 47.139784653941234],
                 [37.59347610486397, 47.14071877482776],
                 [37.59540729535469, 47.140923111583966],
                 [37.597510147222366, 47.140777156838254],
                 [37.5986688615168, 47.14407563629373],
                 [37.5911586762751, 47.14632315549847],
                 [37.584807205327834, 47.148366272316515],
                 [37.57686289892648, 47.15070430540231],
                 [37.574459639649135, 47.15371033083288],
                 [37.56999644384835, 47.15801402960033],
                 [37.56652030096505, 47.16099046168145],
                 [37.56613406286691, 47.16568821615428],
                 [37.56763609991525, 47.16910185162758],
                 [37.5672498618171, 47.17096904658483],
                 [37.56094100276413, 47.17862729229092],
                 [37.558623574175265, 47.18081501231769],
                 [37.55570533076706, 47.18411100693474],
                 [37.553645394243624, 47.18772761510802],
                 [37.55767943660202, 47.19146062960575],
                 [37.56300093928757, 47.1975977449169],
                 [37.559825203813936, 47.19923066733859],
                 [37.563379317079665, 47.204796836189836],
                 [37.56209185675252, 47.207887263205535],
                 [37.5654392536031, 47.21208529071266],
                 [37.55908778265584, 47.215233593285376],
                 [37.54132083014119, 47.19639929512647],
                 [37.54157832220662, 47.18910868528104],
                 [37.54303744391072, 47.177499967917896],
                 [37.54579019082481, 47.17379933520051],
                 [37.544202323087994, 47.17260323473249],
                 [37.545918936857525, 47.170240127794536],
                 [37.54523229134971, 47.168752191704954],
                 [37.54638142121262, 47.16761161990129],
                 [37.54451460373826, 47.1644750801442],
                 [37.54425711167283, 47.163555965967205],
                 [37.54513687622971, 47.16219914930888],
                 [37.54627413285203, 47.16033754604183],
                 [37.547540135507056, 47.1583386614588],
                 [37.55047983658738, 47.155245348773256],
                 [37.551037736062476, 47.15286687741535],
                 [37.551810212258765, 47.15113038017749],
                 [37.552840180520484, 47.14994836220835],
                 [37.552582688455054, 47.14974406014182],
                 [37.553569741372534, 47.14842796547013],
                 [37.55444950592942, 47.1486906459157],
                 [37.55674547684617, 47.145947030567704],
                 [37.55775398743577, 47.145450829691804],
                 [37.559534974221656, 47.145056784520186],
                 [37.56086534989304, 47.14473570851702],
                 [37.561788029794165, 47.14438544157455],
                 [37.56262487900681, 47.14393301002473],
                 [37.56296329511055, 47.14346266001875]]),
            {
              "system:index": "0"
            })]),
    image = ui.import && ui.import("image", "image", {
      "id": "users/svoboj25/Mariopol/Mariupol2020"
    }) || ee.Image("users/svoboj25/Mariopol/Mariupol2020"),
    image2 = ui.import && ui.import("image2", "image", {
      "id": "users/svoboj25/Mariopol/Mariupol2022"
    }) || ee.Image("users/svoboj25/Mariopol/Mariupol2022");
/*
var filter2020 = ee.Filter.or(
        ee.Filter.date('2020-03-04', '2020-03-05'),
        ee.Filter.date('2020-03-14', '2020-03-15'),
        ee.Filter.date('2020-04-03', '2020-04-04'))
// import cloudy Sentinel-2 SR collection
var Mariupol2020 = ee.ImageCollection('COPERNICUS/S2_SR')
.filterBounds(geometry)
.filter(filter2020)
.select(['B12','B11','B9'])
;
var Mariopol2020max = Mariupol2020.reduce(ee.Reducer.max());
Export.image.toAsset({
  image: Mariopol2020max,
  description: 'Mariupol2020',
  maxPixels: 1e13,
  region: geometry
});
var Mariupol2022 = ee.ImageCollection('COPERNICUS/S2_SR')
.filterBounds(geometry)
.filterDate('2022-03-14','2022-03-30')
.select(['B12','B11','B9'])
//.filterMetadata('MGRS_TILE', 'equals', '33UXQ')
;
var Mariopol2022max = Mariupol2022.reduce(ee.Reducer.max());
Export.image.toAsset({
  image: Mariopol2022max,
  description: 'Mariupol2022',
  maxPixels: 1e13,
  region: geometry
});
*/
// import cloudy Sentinel-2 SR collection
var SnimekLedenVyber = ee.ImageCollection('COPERNICUS/S2_SR')
.filterBounds(geometry)
.filterDate('2022-01-08', '2022-01-09')
.select(['B12','B11','B9'])
;
//print(SnimekLedenVyber)
var SnimekLedenVybermax = SnimekLedenVyber.reduce(ee.Reducer.max());
var Map2020 = ui.Map()
var Map2022 = ui.Map()
Map2020.addLayer(image, {min: 0, max: 6000}, 'Mariopol2020', true);
Map2020.addLayer(SnimekLedenVybermax.unmask(0), {min: 0, max: 4000}, 'MariopolLeden', false);
Map2022.addLayer(image2, {min: 1000, max: 7500}, 'Mariopol2022', true);
var splitPanel = ui.SplitPanel({
  firstPanel: Map2022,
  secondPanel: Map2020,
  orientation: "horizontal",
  wipe: true
})
ui.root.clear()
ui.root.add(splitPanel)
var linkPanel = ui.Map.Linker([Map2020,Map2022])
Map2020.centerObject(geometry2,12)
var azovstal = geometry3
var iljich = geometry4
var red = azovstal.style({
  color: 'red',
  width: 2,
  lineType: 'dotted',
  pointSize: 10
});
var green = iljich.style({
  color: '#AAFF00',
  width: 2,
  lineType: 'dotted',
  pointSize: 10
});
Map2020.addLayer(red)
Map2022.addLayer(red)
Map2020.addLayer(green)
Map2022.addLayer(green)
Map2020.setControlVisibility({all: false});
//Map2022.setControlVisibility({all: true});
////////////////////VYTVOŘENÍ PANELU ATD
var panel = ui.Panel()
panel.style().set({ width: '370px',position: "middle-left"});
ui.root.insert(1,panel)
///////////////////////////
var controlPanel = ui.Panel({
  widgets: [  
     ui.Label({value: "březen 2022",
style: {textAlign:'centasdsadered',fontSize: '20px', color: '484848', fontWeight: 'bold'}})],
  style: {position: 'bottom-left'},
  layout: null,
});
Map2022.add(controlPanel);
var DatumBrezen = ui.Panel({
  widgets: [  
     ui.Label({value: "březen 2020",
style: {textAlign:'centasdsadered',fontSize: '20px', color: '484848', fontWeight: 'bold'}})],
  style: {position: 'bottom-right'},
  layout: null,
});
Map2020.add(DatumBrezen);
var DatumLeden = ui.Panel({
  widgets: [  
     ui.Label({value: "8. ledna 2020",
style: {textAlign:'centasdsadered',fontSize: '20px', color: '484848', fontWeight: 'bold'}})],
  style: {position: 'bottom-right', shown: false},
  layout: null,
});
Map2020.add(DatumLeden);
var nazev = ui.Label({value: "Válka na Ukrajině - bitva o Mariupol",
style: {textAlign:'centasdsadered',fontSize: '21px', color: '484848', fontWeight: 'bold'}});
panel.add(nazev)
var podnadpis = ui.Label({value: "z družice Sentinel-2, v březnu 2022",
style: {fontSize: '18px', color: '484848', textAlign:'center'}});
panel.add(podnadpis)
var mezera = ui.Label({value: "",
style: {textAlign:'centasdsadered',fontSize: '15px', color: '484848', fontWeight: 'bold'}});
panel.add(mezera)
var podnadpis = ui.Label({value: "Vrstva k porovnání: ",
style: {margin: '14px'}//, color: '484848', fontWeight: 'bold',textAlign:'center'}
});
var a = 0
var list = ["snímek z 8. ledna 2022","mozaika z března 2020","Google mapy"]
var select = ui.Select({items:list,placeholder:("mozaika z března 2020"),onChange: selectLayer})
function selectLayer(){
  var graph = select.getValue()
  if (graph ==  "snímek z 8. ledna 2022"){
   Map2020.layers().get(0).set('shown', false)
   Map2020.layers().get(1).set('shown', true)
   Map2020.setControlVisibility({all: false});
   DatumBrezen.style().set('shown', false);
   DatumLeden.style().set('shown', true);
  }
 else if(graph == "mozaika z března 2020"){
   Map2020.layers().get(1).set('shown', false)
   Map2020.layers().get(0).set('shown', true)
   Map2020.setControlVisibility({all: false});
   DatumBrezen.style().set('shown', true);
   DatumLeden.style().set('shown', false);
 }
else{
  Map2020.setControlVisibility({mapTypeControl: true})
  Map2020.layers().get(1).set('shown', false)
  Map2020.layers().get(0).set('shown', false)
  DatumBrezen.style().set('shown', false);
  DatumLeden.style().set('shown', false);
}}
///////////////////////////////
var panel2 = ui.Panel({
  widgets: [
    podnadpis,
    select
  ],
  layout: ui.Panel.Layout.flow('horizontal')
});
panel.add(panel2)
var AzovPryc = function(){
if (AzovstalOcel.getValue()== 1){
  Map2020.layers().get(2).set('shown', true);
  Map2022.layers().get(1).set('shown', true);
}else
{
 Map2020.layers().get(2).set('shown', false);
 Map2022.layers().get(1).set('shown', false);
}}
var AzovstalOcel = ui.Checkbox({label: "zobrazit Železárny a ocelárny Azovstal",value: 1, onChange: AzovPryc})
panel.add(AzovstalOcel)
var IljichPryc = function(){
if (IljichOcel.getValue()== 1){
  Map2020.layers().get(3).set('shown', true);
  Map2022.layers().get(2).set('shown', true);
}else
{
 Map2020.layers().get(3).set('shown', false);
 Map2022.layers().get(2).set('shown', false);
}}
var IljichOcel = ui.Checkbox({label: "zobrazit Iljičův hutní závod v Mariupolu",value: 1, onChange: IljichPryc})
panel.add(IljichOcel)
var infohead = ui.Label({value: "",
style: {textAlign:'centasdsadered',fontSize: '15px', color: '484848', fontWeight: 'bold'}});
panel.add(infohead)
var infotext1 = ui.Label({value:
"Vrstvy mapové aplikace jsou vytvořeny z multispektrálních dat družice Sentinel-2 evropského programu Copernicus. Světlé žlutooranžové lokality v mapové aplikaci představují místa, která vykazují vysoké hodnoty teplot v době snímání. Zatímco v březnu roku 2020 bylo možné taková místa nalézt v Mariupolu téměř výhradně v průmyslových částech města (Iljičovy závody a ocelárny Azovstal), tak na snímcích z doby probíhajícího válečného konfliktu se jedná o důkaz dopadů bomb a destruktivní činnosti ruských okupantů v rezidenčních částech tohoto města."
,style: {fontSize: '13px', color: '484848',textAlign:'justify'}});
panel.add(infotext1)
var infotext2 = ui.Label({value:
"Kterak vznikly tyto snímky? V mapovém poli jsou zobrazeny barevné kompozity infračervených snímků (R = B12, G = B11, B = B9) z družice Sentinel-2. Pomocí aplikace je možno porovnat stav z března roku 2020, 8. ledna 2022 a března 2022. Objekty s vysokou teplotou by měly být patrné v tomto kompozitu, jelikož znatelně září ve středních spektrech infračerveného záření, v tzv. Short Wave Infrared (SWIR)."
,style: {fontSize: '13px', color: '484848',textAlign:'justify'}});
panel.add(infotext2)
var copy = ui.Label({value:
"Autor: Jan Svoboda ©EO4Landscape"
,style: {fontSize: '13px', color: '484848',textAlign:'justify'}});
panel.add(copy)